<template>
  <div class="py-40 flex-col flex justify-center items-center px-[20px] w-full">
    <div
      class="max-w-screen-xl w-full flex-col flex justify-center items-center"
    >
      <div
        class="grid grid-cols-6 w-full justify-center items-center space-y-5"
      >
        <div
          class="col-span-6 w-full flex-col flex justify-center items-center"
        >
          <p class="text-[32px] font-bold text-center">
            VPN และ Proxy แตกต่างกันอย่างไร
          </p>
          <p class="text-[20px] max-w-xl text-center">
            ก่อนที่คุณจะหาความแตกต่างระหว่าง VPN และ Proxy คืออะไร
            มาทำความรู้จักกับทั้งสองก่อน
            จากนั้นเราจะเจาะลึกถึงความแตกต่างระหว่างทั้งสอง
          </p>
        </div>

        <div
          class="col-span-6 w-full flex-col flex justify-center items-center px-[20px]"
        >
          <img
            src="../../assets/img/12.png"
            alt=""
            class="rounded-md max-w-xl h-60 md:h-auto"
          />
        </div>
      </div>

      <div class="flex-col w-full mt-10 max-w-4xl space-y-5">
        <div>
          <h1 class="text-[22px] font-bold">Virtual Private Network (VPN)</h1>
          <p>
            เป็นเครื่องมือที่ใช้เพื่อเพิ่มความเป็นส่วนตัวและความปลอดภัยทางออนไลน์โดยสร้างการเชื่อมต่อที่ปลอดภัยและเข้ารหัสระหว่างอุปกรณ์ของผู้ใช้กับอินเทอร์เน็ต
            การเชื่อมต่อนี้สร้างขึ้นโดยการกำหนดเส้นทางการรับส่งข้อมูลทางอินเทอร์เน็ตของผู้ใช้ผ่านเซิร์ฟเวอร์ที่อยู่ในสถานที่ห่างไกล
            ซึ่งทำให้บุคคลที่ 3
            ติดตามกิจกรรมออนไลน์ของผู้ใช้หรือระบุตำแหน่งของพวกเขาได้ยาก
          </p>
        </div>
        <div>
          <h1 class="text-[22px] font-bold">Proxy</h1>
          <p>
            ในทางกลับกัน
            พร็อกซีเซิร์ฟเวอร์ทำหน้าที่เป็นตัวกลางระหว่างอุปกรณ์ของผู้ใช้กับอินเทอร์เน็ต
            เมื่อผู้ใช้ส่งคำขอเพื่อเข้าถึงเว็บไซต์หรือแหล่งข้อมูลออนไลน์อื่นๆ
            คำขอจะถูกส่งไปยังพร็อกซีเซิร์ฟเวอร์ก่อน
            จากนั้นพร็อกซีเซิร์ฟเวอร์จะทำการร้องขอในนามของผู้ใช้
            และส่งคืนข้อมูลที่ร้องขอไปยังอุปกรณ์ของผู้ใช้
          </p>
        </div>

        <div>
          <h1 class="text-[22px] font-bold">
            ข้อแตกต่างที่สำคัญระหว่าง VPN และ Proxy
          </h1>
          <ul class="list-disc pl-10 space-y-5">
            <li>
              <p>
                <label for="" class="font-semibold">ความปลอดภัย: </label>
                แม้ว่าทั้ง VPN และ Proxy
                สามารถช่วยปกป้องความเป็นส่วนตัวบนโลกออนไลน์ของผู้ใช้ได้
                แต่โดยทั่วไปถือว่า VPN มีความปลอดภัยมากกว่า นี่เป็นเพราะ VPN
                ใช้โปรโตคอลการเข้ารหัสที่แข็งแกร่งเพื่อให้แน่ใจว่าข้อมูลผู้ใช้ได้รับการปกป้องจากแฮกเกอร์และบุคคลที่สาม
                ในทางกลับกัน
                พร็อกซี่มักจะไม่ให้การเข้ารหัสและความปลอดภัยในระดับเดียวกัน
              </p>
            </li>

            <li>
              <p>
                <label for="" class="font-semibold">การใช้งาน: </label>
                หากผู้ใช้ต้องการทำงานง่ายๆ เช่น
                ท่องเว็บหรือเข้าถึงเนื้อหาที่จำกัดภูมิภาค
                พร็อกซี่อาจเป็นตัวเลือกที่ดีและมีประสิทธิภาพมากกว่า VPN
              </p>
            </li>

            <li>
              <p>
                <label for="" class="font-semibold">ความเร็ว: </label>
                แม้ว่าทั้ง VPN และ Proxy
                สามารถช่วยปกป้องความเป็นส่วนตัวบนโลกออนไลน์ของผู้ใช้ได้
                แต่โดยทั่วไปถือว่า VPN มีความปลอดภัยมากกว่า นี่เป็นเพราะ VPN
                ใช้โปรโตคอลการเข้ารหัสที่แข็งแกร่งเพื่อให้แน่ใจว่าข้อมูลผู้ใช้ได้รับการปกป้องจากแฮกเกอร์และบุคคลที่สาม
                ในทางกลับกัน
                พร็อกซี่มักจะไม่ให้การเข้ารหัสและความปลอดภัยในระดับเดียวกัน
              </p>
            </li>

            <li>
              <p>
                <label for="" class="font-semibold">ต้นทุน: </label>
                ในบางกรณี พร็อกซี่อาจเป็นตัวเลือกที่คุ้มค่ากว่า VPN
                เป็นเพราะพร็อกซี่มักจะใช้งานได้ฟรีหรือมีค่าใช้จ่ายต่ำกว่า VPN
                ซึ่งอาจมีราคาแพงกว่าในการใช้งาน
              </p>
            </li>

            <li>
              <p>
                <label for="" class="font-semibold">ใช้ในการฟาร์มบัญชี: </label>
                ในการฟาร์มบัญชีที่ใช้ในการตลาดต่างๆ นั้นปฏิเสธไม่ได้เลยว่า Proxy
                ดีกว่า VPN ค่อนข้างมาก อย่างที่รู้กันดีว่า VPN
                มักจะกำหนดให้ผู้ใช้ติดตั้งซอฟต์แวร์พิเศษบนอุปกรณ์ ซึ่งแตกต่างจาก
                Proxy ที่สามารถกำหนดค่าพร็อกซีได้โดยตรงภายในเบราว์เซอร์ของผู้ใช้
                และ VPN ส่วนมากจะแจก IP ให้เพียง 1 IP ส่วน Proxy นั้น สามารถแจก
                IP ได้หลาย IP และยังมีถึง 2 เวอร์ชั่นด้วยกัน (IPv4 และ IPv6)
              </p>
            </li>
          </ul>
        </div>
        <div class="pb-10">
          <p>
            โดยสรุป มีบางสถานการณ์ที่การใช้พร็อกซี่อาจเหมาะสมกว่าการใช้ VPN
            อย่างไรก็ตาม
            สิ่งสำคัญคือต้องประเมินความต้องการเฉพาะของผู้ใช้และสถานการณ์ที่เป็นอยู่ก่อนที่จะตัดสินใจว่าจะใช้เครื่องมือใด
            ทั้งพร็อกซี่และ VPN มีข้อดีและข้อเสียที่แตกต่างกันไป
            และตัวเลือกระหว่างทั้งสองจะขึ้นอยู่กับความต้องการและลำดับความสำคัญของผู้ใช้ในท้ายที่สุด
          </p>
        </div>
        <iframe
          class="h-[500px] w-full rounded-md border-y-2 py-10"
          src="https://www.youtube.com/embed/jUruKI0sCNs?si=pyI6-ukiYIml-JU2"
          title="YouTube video player"
          frameborder="0"
          allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
          allowfullscreen
        ></iframe>
      </div>
    </div>
  </div>
</template>
